/**
 * Властивість innerHtml
 * - зчитування
 * - запис
 */ 

/* Коли треба додати тег, то властивість 
textContent не підходить. Тоді використовуємо
властивість innerHTML, яка вміє працювати 
з тегами, розпарсювати і додавати на сторінку.

Властивість innerHTML старий контент видаляє і
замінює його новим контентом

*/

// const titleEl = document.querySelector(".title");

// titleEl.innerHTML = '<a href="">My title</a>';

// /* Цю властивість добре використовувати для повного
// очищення вмісту елемента*/

// titleEl.innerHTML = ""; // очищає контент елемента
// console.log(titleEl);

/* Висновок
Властивість innerHTML використовується
  - коли треба повністю очистити вміст елемента
  - коли треба видалити попередні дані
і додати нові.
*/

// ---------------------------

/**
 * Вставка розмітки за допомогою insertAdjacementHTML()
 */

/* Бувають випадки, коли не потрібно видаляти
поточний контент, а просто до нього додати щось нове
Для цього викорстовують метод insertAdjacementHTML().
Цей метод приймає в себе два аргументи:
  1. Рядок з вказанням місця, куди буде додана розмітка
  2. Рядок з розміткою, яку потрібно додати

  */ 

// const titleEl = document.querySelector(".title");

// titleEl.insertAdjacentHTML("beforeend", ' <a href="">My title</a>');
// // додав розмітку в елемент titleEl після усіх дочірніх

/* Різниця між innerHTML і insertAdjacentHTML в тому, що 
  - innerHTML все видалить і додасть нове 
  - insertAdjacentHTML просто додасть до вже існуючого у 
вказане місце в розмітці */ 

/* 
1. якщо створюєте елементи з допомогою методу 
createElement, то всередину вони додаються за 
допомогою методу append або prepend

2. якщо ви ці елементи створюєте як рядок, то
всередину вони додаються за допомогою методу
insertAdjacementHTML або зп допомогою
властивості innerHTML
*/