// Автоматизація

/*
Інструменти автоматизації розробки вебпроєктів — 
це набір програмних засобів і скриптів, 
які спрощують та оптимізують рутинні 
завдання під час процесу розробки вебдодатків. 
Вони допомагають автоматизувати багато аспектів 
розробки, зменшуючи час і зусилля, які розробники 
витрачають на такі завдання.

Основні завдання, які можуть бути автоматизовані 
завдяки інструментам автоматизації розробки 
вебпроєктів, включають такі:

1. Збірка та компіляція коду
2. Підтримка різних браузерів
3. Лінтинг (перевірка на помилки) і тестування коду
4. Управління залежностями та пакетами
5. Розгортання та виробнича збірка
6. Моніторинг і тестування на виробництві
7. Генерація документації
*/ 

// ------------------

// Збірка проєкту з Vite

/*
Vite (https://vitejs.dev/) (французьке слово, 
що означає «швидкий», вимовляється [vit], 
як «veet») — це інструмент збірки проєкту для 
розробки вебдодатків на базі JavaScript. Він 
був створений для того, щоб забезпечити швидку 
та ефективну розробку вебпроєктів, а також 
максимально використовувати можливості 
сучасних вебстандартів.

Основні особливості Vite:

1. Швидка розробка
2. Миттєве створення проєкту
3. Широкий спектр мов і технологій
4. Модульна система
5. Гаряча заміна модулів (HMR)
6. Плагін-система
7. Вбудована підтримка CSS і препроцесорів CSS
*/ 

// -----------------

// Node.js

/*
Для того щоб використовувати сучасні інструменти 
веброзробки, необхідно встановити в операційну 
систему твого комп’ютера Node.js — легке та ефективне 
середовище виконання JavaScript поза браузером.

Спочатку Node.js створювався як серверне оточення 
для додатків, але розробники почали використовувати 
його для створення інструментів, які допомагають 
автоматизувати виконання локальних завдань. У 
результаті нова екосистема інструментів, яка виникла 
навколо Node.js, призвела до трансформації процесу фронтенд-розробки.
*/

// node --version

// -----------------

// Пакетний менеджер NPM

/*
Щоб використовувати все різноманіття інструментів 
Node.js, нам необхідна можливість встановлювати їх 
та керувати ними. Для цього створений NPM (node 
package manager) — пакетний менеджер Node.js. Він 
встановлює потрібні інструменти і забезпечує зручний 
інтерфейс для роботи з ними.

NPM сам встановлюється автоматично разом зі 
встановленням Node.js. Якщо інсталяція пройшла 
успішно, у терміналі буде доступна команда npm. 
Щоб переконатися, що встановлення NPM пройшло 
успішно, перевір версію, запустивши в консолі 
таку команду і натиснувши Enter.
*/ 

// npm --version
